Revit 2024 API
AddInId Class
 Identifies an AddIn registered with Revit
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class AddInId : IDisposable
Visual Basic
Public Class AddInId _
	Implements IDisposable
Visual C++
public ref class AddInId : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AddInId
See Also
AddInId Members
Autodesk.Revit.DB Namespace